In [1]:
# This file is created to practise of pandas famework

In [2]:
import pandas as pd 
import numpy as np

In [3]:
# Makinf a dataframe of 2d with list 
list1 = [['abc',1],['def',2],['ghi',3]]
df = pd.DataFrame(list1)
display(df)

     0  1
0  abc  1
1  def  2
2  ghi  3

In [4]:
# adding column name
column = ['Alphabet', 'Number']
df = pd.DataFrame(list1, columns=column)
display(df)

  Alphabet  Number
0      abc       1
1      def       2
2      ghi       3

In [5]:
# Using pd.Dataframe.from_records()
# This method is ideal for working with the sequence of records like list, tuples, dict or objects 
# It treats each item like a row of data
# When to use ?? Use when your data is sstructed like records
# Often from  JSON , CSV or database fetches 

records = [('John', 19), ('Joe', 21)]
df =  pd.DataFrame.from_records(records, columns=['Name', 'Age'])
display(df)

   Name  Age
0  John   19
1   Joe   21

In [6]:
# pd.DataFrame.from_dict()
# When to use ?? Use it when you have dictionary based data 
# If orient = 'index' the keys are treated as row indices

data = {
    'name': ['a','b','c'],
    'age': [18,19,20],
    'div':['x','y','z']
}

df =  pd.DataFrame.from_dict(data, orient='index')
display(df)
df =  pd.DataFrame.from_dict(data)
df

       0   1   2
name   a   b   c
age   18  19  20
div    x   y   z

  name  age div
0    a   18   x
1    b   19   y
2    c   20   z

No matter how we are creating the datatypes we can specify them using dtype arguement or by assiging the types after creation

In [7]:
try:
    df = pd.DataFrame(data, dtype='float' )
except Exception as e :
    print("The error is :",e)
else:
    display(df)
# In this dataframe the column include the str so it will generate the error 
# instead of this we can use 
ddf = pd.DataFrame(data)
ddf = ddf.astype({'age':'float'})
display(ddf)

The error is : could not convert string to float: 'a'

  name   age div
0    a  18.0   x
1    b  19.0   y
2    c  20.0   z

In [8]:
# adding new column in the data Frame 
ddf['N_col'] = ['Tiger','Lion','Elephant']
ddf['N_Int'] = [11,12,122]
ddf

  name   age div     N_col  N_Int
0    a  18.0   x     Tiger     11
1    b  19.0   y      Lion     12
2    c  20.0   z  Elephant    122

In [9]:
ddf = ddf.astype({
    'age' :'float',
    'N_Int':'complex',
    'div':'bool'
})
display(ddf)

  name   age   div     N_col         N_Int
0    a  18.0  True     Tiger   11.0+  0.0j
1    b  19.0  True      Lion   12.0+  0.0j
2    c  20.0  True  Elephant  122.0+  0.0j

In [10]:
ddf = ddf.transpose()
ddf

             0        1         2
name         a        b         c
age       18.0     19.0      20.0
div       True     True      True
N_col    Tiger     Lion  Elephant
N_Int  (11+0j)  (12+0j)  (122+0j)

In [11]:
data = [['Geek1', 28, 'Engineer'],
        ['Geek2', None, 'Data Scientist'],
        ['Geek3', 32, None]]

columns =  ['Name', 'Age','Designation']

df = pd.DataFrame(data , columns=columns)
print(df)

    Name   Age     Designation
0  Geek1  28.0        Engineer
1  Geek2   NaN  Data Scientist
2  Geek3  32.0            None

In [12]:
df = df.replace({'None':np.nan})
df

    Name   Age     Designation
0  Geek1  28.0        Engineer
1  Geek2   NaN  Data Scientist
2  Geek3  32.0            None

In [13]:
data = [['Geek1', 28, 'Engineer'],
        ['Geek2', 25, 'Data Scientist'],
        ['Geek3', '32', 'Manager']]
# here the age is declared as string 
# to_string only can be done when there is only digit in the str 

df = pd.DataFrame(data, columns=columns)


display(df)
# print(df['Age'].dtype)
df['Age'] = pd.to_numeric(df.Age, errors='coerce', downcast='integer')
print(df)

    Name Age     Designation
0  Geek1  28        Engineer
1  Geek2  25  Data Scientist
2  Geek3  32         Manager

    Name  Age     Designation
0  Geek1   28        Engineer
1  Geek2   25  Data Scientist
2  Geek3   32         Manager

In [14]:
data = [('ANSH', 22, 9),
        ('SAHIL', 22, 6),
        ('JAYAN', 23, 8),
        ('AYUSHI', 21, 7),
        ('SPARSH', 20, 8) ]
df = pd.DataFrame.from_records(data, columns=['name', 'age', 'score'])
df

     name  age  score
0    ANSH   22      9
1   SAHIL   22      6
2   JAYAN   23      8
3  AYUSHI   21      7
4  SPARSH   20      8

In [15]:
df.columns =  df.columns.str.capitalize()
df

     Name  Age  Score
0    ANSH   22      9
1   SAHIL   22      6
2   JAYAN   23      8
3  AYUSHI   21      7
4  SPARSH   20      8

In [16]:
df = df.transpose()

In [17]:
df

          0      1      2       3       4
Name   ANSH  SAHIL  JAYAN  AYUSHI  SPARSH
Age      22     22     23      21      20
Score     9      6      8       7       8

In [18]:
df = df.transpose()
df.index = df.index.astype(str).str.upper()
df

     Name Age Score
0    ANSH  22     9
1   SAHIL  22     6
2   JAYAN  23     8
3  AYUSHI  21     7
4  SPARSH  20     8

In [19]:
df = df.transpose()
df

          0      1      2       3       4
Name   ANSH  SAHIL  JAYAN  AYUSHI  SPARSH
Age      22     22     23      21      20
Score     9      6      8       7       8

### Transform vs Apply()

In [21]:
# transfrom return shape matches original 
# works element wise : each group returns something the sam e size as the input
# Ideal when you want to add new column to the dataframe 
# Output shape is always aligned with the original index
 
# df['score_mean'] = df.groupby('AGE')['SCORE'].transform('mean')
# df

In [ ]:
# apply() - Flexible , but shape may change 
# Can return aggregated results, series or even dataframe 

print(df.groupby('AGE')['SCORE'].apply(lambda x: x.mean()))

AGE
20    8.0
21    7.0
22    7.5
23    8.0
Name: SCORE, dtype: float64

In [ ]:
df['score_mean_apply']= df.groupby('AGE')['SCORE'].apply(lambda x: x.mean())
df
# This will give the missing values because there is 4 output and we need 5 answer to fill the column

     NAME AGE SCORE score_mean  score_mean_apply
0    ANSH  22     9        7.5               NaN
1   SAHIL  22     6        7.5               NaN
2   JAYAN  23     8        8.0               NaN
3  AYUSHI  21     7        7.0               NaN
4  SPARSH  20     8        8.0               NaN

### Pivot vs Pivot_Table()

Pivoting is a powerful technique to reshape detailed (long - form) data into a summary table (wide-form ) --ideal for spotting trends and comparing group statistics.

pivot() --  Strict but Simple

* Best used when your data is perfectly clean, meaning there is one unique value for every combination of index and columns.

* Converts rows into columns for easier comparison.

* It is fast and straightforward, but throws an error if duplicate entries exist.

In [ ]:
data = [('ANSH', 22, 9),
        ('SAHIL', 22, 6),
        ('JAYAN', 23, 8),
        ('AYUSHI', 21, 7),
        ('SPARSH', 20, 8) ]

df = pd.DataFrame(data , columns=['Name','Age','Score'])
df_p = df.pivot(index='Name', columns='Score', values='Age')
print(df_p)

Score      6     7     8     9
Name
ANSH     NaN   NaN   NaN  22.0
AYUSHI   NaN  21.0   NaN   NaN
JAYAN    NaN   NaN  23.0   NaN
SAHIL   22.0   NaN   NaN   NaN
SPARSH   NaN   NaN  20.0   NaN

In [ ]:
df_pivot = pd.DataFrame({
    'Department': ['HR', 'HR', 'Sales', 'Sales', 'IT'],
    'Gender': ['M', 'F', 'M', 'F', 'M'],
    'Salary': [3000, 3200, 4000, 3900, 4500]
})

try:
    pivot = pd.pivot(df, index="Department", columns="Gender", values="Salary")

except Exception as e:
    print(e)

else:
    print(pivot)

'Department'

pivot_table() — Flexible and Powerful

* Works just like pivot(), but with aggregation support — great for handling duplicates or missing data.

* Lets you group data by one or more keys.

* Supports common aggregations like mean, sum, count, and even multiple functions.

* Accepts multiple columns in index, columns, and values.

In [ ]:
pivot_t = df_pivot.pivot_table(index='Department', columns='Gender', values='Salary', aggfunc='mean')
pivot

Gender           F       M
Department
HR          3200.0  3000.0
IT             NaN  4500.0
Sales       3900.0  4000.0

Create a Pandas DataFrame from list of Dictionaries
* df = pd.DataFrame.from_records()  # we can also pass the index
* Using pd.json_normalize()
* df = pd.DataFrame.from_dict()
* Using pd.DataFrame()

In [ ]:
data = [{'This':'dataframe', 'Side':'Using', 'Nirav':'List' },
        {'This': 10, 'Side':20, 'Nirav': 30 }]

df = pd.DataFrame.from_records(data)
display(df)
df = pd.DataFrame.from_dict(data)
display(df)

        This   Side Nirav
0  dataframe  Using  List
1         10     20    30

        This   Side Nirav
0  dataframe  Using  List
1         10     20    30

In [ ]:
df = pd.json_normalize(data)
df

        This   Side Nirav
0  dataframe  Using  List
1         10     20    30

In [ ]:
df = pd.DataFrame(data)
df

        This   Side Nirav
0  dataframe  Using  List
1         10     20    30

In [ ]:
# with two column indices, values same as ditionary keys

df1 = pd.DataFrame(data, index=['ind1','ind2'],
                   columns=['This', 'Side'])
# With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['indx','indy'])
display(df1)
display(df2)

           This   Side
ind1  dataframe  Using
ind2         10     20

           This   Side Nirav
indx  dataframe  Using  List
indy         10     20    30

 Convert list of nested dictionaries into Pandas dataframe 
 * Using from_dict(orient='index')
 * Native methods

In [ ]:
countries = {
    "1": {"Country": "New Country 1",
          "Capital": "New Capital 1",
          "Population": "123,456,789"},
    "2": {"Country": "New Country 2",
          "Capital": "New Capital 2",
          "Population": "987,654,321"},
    "3": {"Country": "New Country 3",
          "Capital": "New Capital 3",
          "Population": "111,222,333"}
}
data = pd.DataFrame.from_dict(countries , orient='index')
data

         Country        Capital   Population
1  New Country 1  New Capital 1  123,456,789
2  New Country 2  New Capital 2  987,654,321
3  New Country 3  New Capital 3  111,222,333

In [ ]:
list = [{
        "Student": [{"Exam": 90, "Grade": "a"},
                    {"Exam": 99, "Grade": "b"},
                    {"Exam": 97, "Grade": "c"},
                    ],
        "Name": "Paras Jain"
        },
        {
        "Student": [{"Exam": 89, "Grade": "a"},
                    {"Exam": 80, "Grade": "b"}
                    ],
        "Name": "Chunky Pandey"
        }
        ]

data = pd.DataFrame.from_dict(list)
display(data)

                                             Student           Name
0  [{'Exam': 90, 'Grade': 'a'}, {'Exam': 99, 'Gra...     Paras Jain
1  [{'Exam': 89, 'Grade': 'a'}, {'Exam': 80, 'Gra...  Chunky Pandey

In [ ]:
rows = []

for data in list:
    data_row = data['Student']
    time = data['Name']

    for row in data_row:
        row['Name'] = time
        rows.append(row)
print(rows)

[{'Exam': 90, 'Grade': 'a', 'Name': 'Paras Jain'}, {'Exam': 99, 'Grade': 'b', 'Name': 'Paras Jain'}, {'Exam': 97, 'Grade': 'c', 'Name': 'Paras Jain'}, {'Exam': 89, 'Grade': 'a', 'Name': 'Chunky Pandey'}, {'Exam': 80, 'Grade': 'b', 'Name': 'Chunky Pandey'}]

In [ ]:
df = pd.DataFrame(rows)
display(df)

   Exam Grade           Name
0    90     a     Paras Jain
1    99     b     Paras Jain
2    97     c     Paras Jain
3    89     a  Chunky Pandey
4    80     b  Chunky Pandey

In [ ]:
df.set_index('Name', inplace =  True) # to make column name in index
display(df)

               Exam Grade
Name
Paras Jain       90     a
Paras Jain       99     b
Paras Jain       97     c
Chunky Pandey    89     a
Chunky Pandey    80     b

In [ ]:
# Using pivot-table
df = df.pivot_table(index='Name', columns=['Grade'],
                    values=['Exam']).reset_index()

df.columns=['NAME','Maths','Physics','Chemistry']

print(df)

            NAME  Maths  Physics  Chemistry
0  Chunky Pandey   89.0     80.0        NaN
1     Paras Jain   90.0     99.0       97.0

In [ ]:
df = pd.DataFrame({'City':['New York', 'Parague', 'New Delhi', 'Venice', 'new Orleans'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy', 'Tech_Summit'],
                    'Cost':[10000, 5000, 15000, 2000, 12000]})
display(df)

          City        Event   Cost
0     New York        Music  10000
1      Parague       Poetry   5000
2    New Delhi      Theatre  15000
3       Venice       Comedy   2000
4  new Orleans  Tech_Summit  12000

In [ ]:
index_ = [pd.Period('02-2018', freq='M'), pd.Period('04-2018', freq='M'),
          pd.Period('06-2018', freq='M'), pd.Period('10-2018', freq='M'), pd.Period('12-2018', freq='M')]

df.index = index_

display(df)

                City        Event   Cost
2018-02     New York        Music  10000
2018-04      Parague       Poetry   5000
2018-06    New Delhi      Theatre  15000
2018-10       Venice       Comedy   2000
2018-12  new Orleans  Tech_Summit  12000

In [ ]:
df['City'] = df['City'].replace('[nN]ew',  'New_', regex=True)
df

                 City        Event   Cost
2018-02     New_ York        Music  10000
2018-04       Parague       Poetry   5000
2018-06    New_ Delhi      Theatre  15000
2018-10        Venice       Comedy   2000
2018-12  New_ Orleans  Tech_Summit  12000

In [ ]:

df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':[' UMbreLla', '  maTtress', 'BaDmintoN ', 'Shuttle'],
                   'Updated_Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 8, 15, 10]})

df

        Date     Product  Updated_Price  Discount
0  10/2/2011    UMbreLla           1250        10
1  11/2/2011    maTtress           1450         8
2  12/2/2011  BaDmintoN            1550        15
3  13/2/2011     Shuttle            400        10

In [ ]:
df['Product'] = df['Product'].apply(lambda x : x.strip().capitalize())
df

        Date    Product  Updated_Price  Discount
0  10/2/2011   Umbrella           1250        10
1  11/2/2011   Mattress           1450         8
2  12/2/2011  Badminton           1550        15
3  13/2/2011    Shuttle            400        10

In [ ]:
df['Date'] = pd.to_datetime(df['Date'], errors='coerce')
display(df)

        Date    Product  Updated_Price  Discount
0 2011-02-10   Umbrella           1250        10
1 2011-02-11   Mattress           1450         8
2 2011-02-12  Badminton           1550        15
3 2011-02-13    Shuttle            400        10

In [ ]:
new_index = [3,0,2,5,1]
new_co_index = ['Date', 'Product', 'Updated_Price', 'Discount','Temp']
a = df.reindex(new_index,columns=new_co_index, fill_value=0)
display(a)

                  Date    Product  Updated_Price  Discount  Temp
3  2011-02-13 00:00:00    Shuttle            400        10     0
0  2011-02-10 00:00:00   Umbrella           1250        10     0
2  2011-02-12 00:00:00  Badminton           1550        15     0
5                    0          0              0         0     0
1  2011-02-11 00:00:00   Mattress           1450         8     0

In [ ]:
a_temp = df.reindex(new_index, columns=new_co_index)
a_fill = a_temp.ffill()
a_fill = a_fill.ffill(axis=1)
display(a_fill)

                  Date    Product Updated_Price Discount  Temp
3  2011-02-13 00:00:00    Shuttle         400.0     10.0  10.0
0  2011-02-10 00:00:00   Umbrella        1250.0     10.0  10.0
2  2011-02-12 00:00:00  Badminton        1550.0     15.0  15.0
5  2011-02-12 00:00:00  Badminton        1550.0     15.0  15.0
1  2011-02-11 00:00:00   Mattress        1450.0      8.0   8.0

In [ ]:
initial_data = {'First_name': ['Ram', 'Mohan', 'Tina', 'Jeetu', 'Meera', 'happens'],
                'Last_name': ['Kumar', 'Sharma', 'Ali', 'Gandhi', 'Kumari', 'Nothing'],
                'Age': [42, 52, 36, 21, 23, 99],
                'City': ['Mumbai', 'Noida', 'Pune', 'Delhi', 'Bihar', 'nooo']}


df = pd.DataFrame(initial_data)
df

  First_name Last_name  Age    City
0        Ram     Kumar   42  Mumbai
1      Mohan    Sharma   52   Noida
2       Tina       Ali   36    Pune
3      Jeetu    Gandhi   21   Delhi
4      Meera    Kumari   23   Bihar
5    happens   Nothing   99    nooo

In [ ]:

# Create new column using dictionary
new_data = { "Ram":"B.Com",
            "Mohan":"IAS",
            "Tina":"LLB",
            "Jeetu":"B.Tech",
            "Meera":"MBBS",
            "Teena": "Noneed" }

df['Qualification'] = df['First_name'].map(new_data)
df

  First_name Last_name  Age    City Qualification
0        Ram     Kumar   42  Mumbai         B.Com
1      Mohan    Sharma   52   Noida           IAS
2       Tina       Ali   36    Pune           LLB
3      Jeetu    Gandhi   21   Delhi        B.Tech
4      Meera    Kumari   23   Bihar          MBBS
5    happens   Nothing   99    nooo           NaN

What happened in the above table

Key in First_name : There is NaN in qualification because there is no teena in the dataframe 

Key in newdata not in First_name ignored silently

Method 2: Using replace function 
* with regex
* without regex

In [ ]:
# Creating new dataframe
import pandas as pd
initial_data = {'First_name': ['Ramm', 'Mohan', 'Tina', 'Jeetu', 'Meera'],
                'Last_name': ['Kumar', 'Sharma', 'Ali', 'Gandhi', 'Kumari'],
                'Age': [42, 52, 36, 21, 23],
                'City': ['Mumbai', 'Noida', 'Pune', 'Delhi', 'Bihar']}

df = pd.DataFrame(initial_data, columns=['First_name','Last_name', 'Age', 'City'])


df

  First_name Last_name  Age    City
0       Ramm     Kumar   42  Mumbai
1      Mohan    Sharma   52   Noida
2       Tina       Ali   36    Pune
3      Jeetu    Gandhi   21   Delhi
4      Meera    Kumari   23   Bihar

In [ ]:
new_data = { "Ramm":"Ram",
            "Tina":"Riya",
            "Jeetu":"Jitender" }

print(df, end="\n\n")

  First_name Last_name  Age    City
0       Ramm     Kumar   42  Mumbai
1      Mohan    Sharma   52   Noida
2       Tina       Ali   36    Pune
3      Jeetu    Gandhi   21   Delhi
4      Meera    Kumari   23   Bihar

In [ ]:
df = df.replace({'First_name':new_data})
print(df)

  First_name Last_name  Age    City
0        Ram     Kumar   42  Mumbai
1      Mohan    Sharma   52   Noida
2       Riya       Ali   36    Pune
3   Jitender    Gandhi   21   Delhi
4      Meera    Kumari   23   Bihar

In [ ]:
# Update work on the index

initial_data = {'First_name': ['Ram', 'Mohan', 'Tina', 'Jeetu', 'Meera'],
                'Last_name': ['Kumar', 'Sharma', 'Ali', 'Gandhi', 'Kumari'],
                'Age': [42, 52, 36, 21, 23],
                'City': ['Mumbai', 'Noida', 'Pune', 'Delhi', 'Bihar']}

new_data = { 0:"Shyam",
            2:"Riya",
            3:"Jitender" }


df = pd.DataFrame(initial_data)
display(df)
# df["First_name"].update(pd.Series(new_data)) #this will give the warning
df.update(pd.DataFrame({"First_name": new_data}))

display(df)

  First_name Last_name  Age    City
0        Ram     Kumar   42  Mumbai
1      Mohan    Sharma   52   Noida
2       Tina       Ali   36    Pune
3      Jeetu    Gandhi   21   Delhi
4      Meera    Kumari   23   Bihar

  First_name Last_name  Age    City
0      Shyam     Kumar   42  Mumbai
1      Mohan    Sharma   52   Noida
2       Riya       Ali   36    Pune
3   Jitender    Gandhi   21   Delhi
4      Meera    Kumari   23   Bihar

To ungroup the group we use unstack()

In [ ]:
data = {
    'Department': ['Sales', 'Sales', 'HR', 'HR'],
    'Gender': ['Male', 'Female', 'Male', 'Female'],
    'Salary': [5000, 5200, 4800, 5100]
}
df = pd.DataFrame(data)
df

  Department  Gender  Salary
0      Sales    Male    5000
1      Sales  Female    5200
2         HR    Male    4800
3         HR  Female    5100

In [ ]:
df_g = df.groupby(['Department','Gender'])['Salary'].mean()
print(df_g)

Department  Gender
HR          Female    5100.0
            Male      4800.0
Sales       Female    5200.0
            Male      5000.0
Name: Salary, dtype: float64

In [ ]:
df_u = df_g.unstack()
print(df_u)

Gender      Female    Male
Department
HR          5100.0  4800.0
Sales       5200.0  5000.0

melt()

The melt() method in pandas is your go-to tool when you need to transform wide-format data into long-format — essentially doing the opposite of a pivot. It’s perfect for turning column headers into row values, making your data tidy and ready for analysis.

Why use melt()? It simplifies datasets where values are spread across multiple columns but would be better analyzed in a key-value format.

In [ ]:
df = pd.DataFrame({
    'Name': ['Ansh', 'Harsh'],
    'Math':[66,89],
    'Science':[99,67]
})
print(df)

    Name  Math  Science
0   Ansh    66       99
1  Harsh    89       67

In [ ]:
df_melted = df.melt( id_vars="Name",var_name='Subject', value_name='Marks')
df_melted

    Name  Subject  Marks
0   Ansh     Math     66
1  Harsh     Math     89
2   Ansh  Science     99
3  Harsh  Science     67

Key parameters: id_vars: Columns to keep as identifiers (they won’t be unpivoted)

var_name: Name of the new column for former column headers

value_name: Name of the new column for values

How pandas figures it out: id_vars='Name' → This tells pandas: “Hey, keep the Name column as is.”

Everything else (like Math and Science) → Becomes part of the Subject column — because they’re the column headers being melted.

Their cell values (like 90, 85, 80, 89) → Go under the new column called Marks, which you assigned using value_name='Marks'.

### Reset Index in Pandas Dataframe
Syntax :

DataFrame.reset_index(level=None, drop=False, inplace=False, col_level=0, col_fill='')

Parameters:

* level: Specifies multi-level index levels to reset.
* drop: Discards current index if True; adds as a new column if False.
* inplace: Modifies DataFrame in place if True; returns a new DataFrame if False.
* col_level: Specifies which level of multi-level columns to reset.
* col_fill: Fills missing values in columns' levels. Return Type: Returns a new DataFrame if inplace is False; None if inplace is True
used methods

* Create Own Index Without Removing Default Index
* Create your Own Index and Remove the Default Index
* Reset Own Index and Create Default Index as Index
* Make a Column of Dataframe as Index and Removing Default Index
* Make a Column of Dataframe as an Index Without Removing Index

In [35]:
data = {
    'Name':['Nirav', 'Vala',' Arpi',' Vaibhav ', 'Thapa'],
    'Age':[19,15,16,17,18,],
    'Address':['Surat', 'Gandhinagar', 'Vadodara', 'Karnavati', 'Daman'],
    'Qualification':['12th', '10th', '10th','11th', '11th']
}

df = pd.DataFrame.from_dict(data)
print(df)

        Name  Age      Address Qualification
0      Nirav   19        Surat          12th
1       Vala   15  Gandhinagar          10th
2       Arpi   16     Vadodara          10th
3   Vaibhav    17    Karnavati          11th
4      Thapa   18        Daman          11th

In [36]:
df['Name'] = df['Name'].apply(lambda x: x.strip())

In [37]:
df

      Name  Age      Address Qualification
0    Nirav   19        Surat          12th
1     Vala   15  Gandhinagar          10th
2     Arpi   16     Vadodara          10th
3  Vaibhav   17    Karnavati          11th
4    Thapa   18        Daman          11th

In [38]:
list = []
for i in df['Name']:
    list.append(i)

print(list)

['Nirav', 'Vala', 'Arpi', 'Vaibhav', 'Thapa']

In [39]:
#Create Own Index without Removing Default Index

index_ = ['h','e','l','l','o']
df = pd.DataFrame(data, index=index_)
df

        Name  Age      Address Qualification
h      Nirav   19        Surat          12th
e       Vala   15  Gandhinagar          10th
l       Arpi   16     Vadodara          10th
l   Vaibhav    17    Karnavati          11th
o      Thapa   18        Daman          11th

In [40]:
df.reset_index(inplace=True , drop = True )
df

        Name  Age      Address Qualification
0      Nirav   19        Surat          12th
1       Vala   15  Gandhinagar          10th
2       Arpi   16     Vadodara          10th
3   Vaibhav    17    Karnavati          11th
4      Thapa   18        Daman          11th

In [42]:
df = pd.DataFrame(data , index_)
df.set_index(['Age'], inplace=True)
df
print(df.loc[17])

Name              Vaibhav
Address          Karnavati
Qualification         11th
Name: 17, dtype: object

In [43]:
df.reset_index(level=['Age'], inplace=True)
df

   Age       Name      Address Qualification
0   19      Nirav        Surat          12th
1   15       Vala  Gandhinagar          10th
2   16       Arpi     Vadodara          10th
3   17   Vaibhav     Karnavati          11th
4   18      Thapa        Daman          11th

Changing Column Names and Row Indexes in Pandas

* Method 1: Using .columns and .index directly

* Method 2: Using .rename() with a dictionary

* Method 3: With lambda functions Dynamically change all names

* Method 4: Using .columns.values Modify a specific column name

In [44]:
df = pd.DataFrame({
    "Name": ['Tom', 'Nick', 'John', 'Peter'],
    "Age": [15, 26, 17, 28]
})
print("Original DataFrame:")
display(df)

Original DataFrame:

    Name  Age
0    Tom   15
1   Nick   26
2   John   17
3  Peter   28

In [45]:
# Method 1
df.columns = ['column1', 'column2']
df.index = [4,4,7,8]
df

  column1  column2
4     Tom       15
4    Nick       26
7    John       17
8   Peter       28

In [49]:
# method - 2
df.rename(columns={"column1": "ncol1"}, index={7: 8}, inplace=True)
df

   ncol1  column2
4    Tom       15
4   Nick       26
8   John       17
8  Peter       28